{
  "header": "Portfolio-Seite",
  "description": [
    "Diese Portfolio-Seite ist eine moderne, vollständig responsive Single Page Application (SPA), die überwiegend mit Vanilla JavaScript und CSS entwickelt wurde.",
    "Sie kombiniert eine klare Struktur mit zweisprachiger Unterstützung (Deutsch & Englisch), dynamischem Theme-Wechsel (Hell/Dunkel) und einem modularen Aufbau für zukunftssichere Erweiterbarkeit.",
    "Eigens entwickelte UI-Komponenten wie Navigationsleiste, Sidebar, Toast-Benachrichtigungen und Breadcrumbs ergänzen Features wie ein Icon-Karussell, eine umfassende Datenschutzerklärung, einen integrierten Chatbot sowie eine Google-Analytics-Auswertung mit Chart.js."
  ],
  "features_title": "Funktionen",
  "features": [
    {
      "title": "Großteils Vanilla",
      "desc": [
        "Sowohl CSS als auch JavaScript wurden größtenteils in reinem Vanilla-Code umgesetzt.",
        "Bootstrap kam lediglich für Abstände, Dropdowns (die Tooltips sind in Vanilla realisiert) und Bildkarussells zum Einsatz.",
        "Alpine.js steuert alle interaktiven Logiken und den Zugriff auf Daten in spezifischen Kontexten."
      ]
    },
    {
      "title": "Themen",
      "desc": [
        "Die Portfolio-Seite unterstützt sowohl ein helles als auch ein dunkles Design.",
        "Die Themen wurden vollständig über CSS-Variablen umgesetzt."
      ]
    },
    {
      "title": "Responsive",
      "desc": [
        "Die Seite ist vollständig responsiv gestaltet.",
        "Sie basiert auf einem flexiblen 12-Spalten-Rasterlayout."
      ]
    },
    {
      "title": "Modular",
      "desc": [
        "Der modulare Aufbau ermöglicht eine einfache Erweiterung um zukünftige Funktionen.",
        "Die Projektstruktur ist übersichtlich und gut wartbar angelegt."
      ]
    },
    {
      "title": "SPA",
      "desc": [
        "Die Seite ist als Single Page Application (SPA) realisiert.",
        "Navigation erfolgt über Hash-Routing mit 404-Redirect-Handling.",
        "Die History API wird genutzt, um nahtlose Navigation zu ermöglichen.",
        "Inhalte werden per Fetch-API geladen und unterstützen Lazy-Loading."
      ]
    },
    {
      "title": "Duale Sprachunterstützung (Deutsch & Englisch)",
      "desc": [
        "Die Seite unterstützt sowohl Deutsch als auch Englisch.",
        "Texte werden je nach Spracheinstellung dynamisch geladen.",
        "Die Sprache wird standardmäßig über die Browsereinstellungen ermittelt, kann aber manuell geändert werden."
      ]
    },
    {
      "title": "Toast-Benachrichtigungen",
      "desc": [
        "Individuell entwickelte Toast-Nachrichten informieren über Systemereignisse.",
        "Diese können angepinnt, angeklickt oder gelöscht werden.",
        "Ein Rechtsklick löscht sie mit einer Animation."
      ]
    },
    {
      "title": "Navigationsleiste",
      "desc": [
        "Die Navigationsleiste wurde vollständig eigenständig entwickelt.",
        "Sie enthält ein Burger-Menü für kleinere Bildschirme."
      ]
    },
    {
      "title": "Breadcrumbs",
      "desc": [
        "Zur Orientierung wurde eine Breadcrumb-Navigation integriert.",
        "Diese wird über eine generische Funktion automatisch erzeugt."
      ]
    },
    {
      "title": "Icon-Karussell",
      "desc": [
        "Ein automatisch rotierendes Karussell zeigt Icons mit Beschriftung.",
        "Die Animation bleibt innerhalb der Grenzen des Elternelements."
      ]
    },
    {
      "title": "Icon-Farbe & Animation",
      "desc": [
        "Alle Icons (außer im Karussell) verfügen über animierte Farbübergänge beim Hover-Effekt.",
        "Diese Animationen können ein- und ausgeschaltet werden."
      ]
    },
    {
      "title": "Datenschutz",
      "desc": [
        "Eine verpflichtende Datenschutzerklärung muss akzeptiert oder abgelehnt werden.",
        "Darin wird erklärt, welche Daten wie und zu welchem Zweck gespeichert werden und wie man diese löschen kann.",
        "Die Seite ist ohne Interaktion mit der Datenschutzerklärung nicht nutzbar."
      ]
    },
    {
      "title": "Chatbot",
      "desc": [
        "Ein DeepSeek-basierter Chatbot ist integriert.",
        "Dieser verwendet eine freie API eines DeepSeek-Forks.",
        "Bereitgestellt wird der Dienst über einen eigenen Cloudflare Worker, um den API-Schlüssel zu schützen.",
        "Das Frontend war kurzzeitig als Chrome-Erweiterung verfügbar, wurde jedoch aus regulatorischen Gründen entfernt."
      ]
    },
    {
      "title": "Sidebar",
      "desc": [
        "Eine ein- und ausklappbare Sidebar erleichtert die Navigation zwischen Seiten."
      ]
    },
    {
      "title": "Google Analytics",
      "desc": [
        "Die aktuelle Version von Google Analytics ist eingebunden.",
        "Es wird erfasst, wie viele Besucher die Seite aufrufen und wie oft bestimmte Events ausgelöst werden.",
        "Die Daten sind anonymisiert und werden nur für eine Woche gespeichert.",
        "Visualisierung erfolgt mit Chart.js.",
        "Aktuell kann es durch API-Änderungen zu Einschränkungen kommen."
      ]
    }
  ]
  
}