{
    "header": "Welcome to Fantasy Quest!",
    "description": [
      "The idea behind the app was to create a combination of Pokémon Go, the original Pokémon games, and Final Fantasy 1.",
      "Players can create characters and choose from four roles: Dark Mage, Warrior, Healer, or Thief.",
      "Characters can move around the overworld and encounter enemies after traveling a specific distance.",
      "There are three different enemy types with unique stats and attacks.",
      "Note: This app is a prototype and does not include all planned features."
    ],
    "features": {
      "title": "Features",
      "roles": "Character creation with four roles: Dark Mage, Warrior, Healer, and Thief.",
      "overworld": "Overworld exploration with enemy encounters based on movement.",
      "enemies": "Three enemy types with unique stats and attacks.",
      "technology": "Built in Kotlin with Mapbox API for map rendering and a Spring Boot API for backend data processing.",
      "database": "Uses MariaDB for data storage."
    },
    "installation": {
      "title": "Installation",
      "step1": "Recommended software: XAMPP, IntelliJ, Android Studio (Version Giraffe 2022.3.1 Patch 4).",
      "step2": "Why XAMPP? MySQL and Tomcat are required.",
      "step3": "Start the Spring Boot backend.",
      "step4": "Find your local IP address and update it in the frontend code.",
      "step5": "Update the frontend code: Open the app in Android Studio, locate the file 'HostIP.kt', and replace the 'hostIP' variable with your local IP address.",
      "step6": "Start the MariaDB server on your local machine (recommended: XAMPP, or configure manually).",
      "step7": "Seed the database: Make an HTTP GET request to the following URL (local development environment): http://localhost:8080/api/init.",
      "step8": "Create a Mapbox API Key and add it to the 'settings.gradle.kts' file. Enter the username (Mapbox) and API Key under credentials.",
      "step9": "After installing the app: Enable app permissions on your phone (location access). Go to App Info -> Permissions -> Location -> 'Allow all the time' or 'Allow only while using the app'. Enable 'Use precise location'.",
      "step10": "For users 'a' and 'testuser', a 'Play' button is visible in the overworld view to initiate battles."
    }
  }
  